export const courses = [
  {
    id: 1,
    name: "جاوااسکریپت-React",
    summary:
      "یادگیری زبان HTML، CSS و جاوا اسکریپت برای ساخت صفحات وب لازم است اما ممکن است در آگهی‌های استخدام به جز این سه زبان، اسم دیگری به نام ReactJS را دیده باشید",
    description:
      "جاوا اسکریپت یک زبان برنامه نویسی است که برای ایجاد عناصر پویا در وب‌سایت‌ها و یا برنامه‌های وب استفاده می‌شود. امروزه تقریباً تمام مرورگرها از جاوا اسکریپت پشتیبانی می‌کنند. با وارد شدن به هر صفحه وب می‌توانید عناصری از قبیل فرم اعتبار‌سنجی، انیمیشن‌های پیشرفته، پنجره‌ها و… که تماماً با استفاده از جاوا اسکریپت نوشته شده است را مشاهده کنید. درواقع جاوا اسکریپت نوعی اسکریپت نویسی کلاینت ساید است که برای ساخت برنامه‌ها و صفحات وب در سمت کاربر استفاده می‌شود.",
  },
  {
    id: 2,
    name: "پایتون",
    summary:
      "پایتون زبان برنامه نویسی شی گرا که در سال ۱۹۹۱ منتشر شده است. تنوع پایتون، سازگاری، یادگیری اصول اولیه آسان‌تر آن را از دیگر زبان‌های برنامه‌نویسی جدا کرده است",
    description:
      "پایتون می‌تواند بر روی سیستم‌عامل‌های مختلف مانند ویندوز، مک و لینوکس به‌خوبی کار می‌کند. نحوه نوشتن و قرارگیری کدها در این زبان بسیار ساده است و ساختار آن همانند زبان انگلیسی می‌باشد. این زبان این امکان را به برنامه نویسان می‌دهد تا تعداد کد و خط‌های کمتری را نسبت به سایر زبان‌های برنامه نویسی دیگر بنویسند. به همین دلیل برخی از برنامه نویسان اعتقاد دارند که یادگیری این زبان نسبت به زبان های دیگر برنامه نویسی راحت تر است. این زبان بر روی یک سیستم مفسر کار می‌کند و هر خط باید جداگانه تفسیر شود. از این زبان می‌توان به‌عنوان برنامه نویسی شی‌ءگرا و هم برنامه نویسی تابعی استفاده کرد.",
  },
  {
    id: 3,
    name: "PHP-لاراول",
    summary:
      "PHP یک زبان برنامه نویسی اوپن سورسه که با قابلیت توسعه داخلی وب ساخته شده و امروزه به‌طور گسترده‌ توسط برنامه نویسان وب استفاده می‌شه. اسکریپت این زبان روی سرور اجرا میشه",
    description:
      "ین زبان بر روی سیستم‌عامل‌های مختلف اعم از ویندوز، لینوکس، مک و غیره اجرا می‌شود. این زبان تقریباً با کلیه سرور مورد استفاده امروز مانند Apache، IIS و… سازگار است. همچنین PHP از طیف‌های گسترده پایگاه‌های داده پشتیبانی می‌کند. PHP کاملاً رایگان است و شما می‌توانید آن را از طریق سایت PHP.net دانلود کنید. یادگیری این زبان ساده است و به راحتی در سمت سرور اجرا می‌شود. شما می‌توانید صفحات داینامیک را با یادگیری برنامه نویسی PHP ایجاد کنید.",
  },
  {
    id: 4,
    name: "جاوا-اسپرینگ",
    summary:
      "(java) یک زبان برنامه نویسی شی‌ءگرای محبوب است که در سال 1995 توسط جیمز آرتور گاسلینگ منتشر شده است. این زبان در ابتدا برای دستگاه‌های ستاپ باکس طراحی شده بود اما امروزه برای ایجاد برنامه‌های وب و موبایل استفاده می‌شود",
    description:
      "بازار کار برنامه نویسی جاوا در حوزه وب و به‌خصوص برنامه نویسی اندروید در وضعیت بسیار خوبی قرار دارد. شرکت‌های خصوصی به شدت نیازمند استخدام برنامه نویسان اندروید هستند. اکثر شرکت‌های در حال حاضر شرکت‌های دولتی برای پروژه‌های بزرگ از این زبان استفاده می‌کنند. البته کمتر شرکتی از این زبان به‌عنوان انتخاب اول برای بک‌اند برنامه‌های خود استفاده می‌کند. با در نظر گرفتن فاکتور های گوناگون مانند شهر، سابقه و… اگر شما به این زبان مسلط باشید می‌توانید حقوقی معادل ۳.۵ الی ۶ میلیون تومان در ماه داشته باشید.",
  },
];
